johnnyclem/neon-link/sdkconfig.defaults.p4v31
# Second P4 DUT — rev v3.1 / eco6. IDF 5.3.2 cannot boot this silicon.
# Build with IDF 5.5.5:
#   . ~/esp/esp-idf-v5.5.5/export.sh
#   idf.py -B build-p4v31 -DSDKCONFIG=sdkconfig.p4v31 \
#     -DSDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.p4v31" \
#     set-target esp32p4 build
#
# Pin map reused from the Waveshare P4-DEV-KIT overlay until this
# board's header is confirmed (I2C 7/8, encoder 2/3/4, Hosted SDIO).

CONFIG_IDF_TARGET="esp32p4"
CONFIG_NEON_BOARD_P4DEVKIT=y
# CONFIG_NEON_BOARD_CUSTOM is not set
# CONFIG_NEON_BOARD_AMYBOARD is not set

# CONFIG_ESP32P4_SELECTS_REV_LESS_V3 is not set
CONFIG_ESP32P4_REV_MIN_301=y

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHFREQ="80m"

CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_16mb.csv"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_20M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# WCH USB-UART on the default P4 console pins (GPIO 37/38).
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG is not set

# CONFIG_ESP_HOST_WIFI_ENABLED is not set
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_WIFI_RMT_CACHE_TX_BUFFER_NUM=32
# CONFIG_BT_ENABLED is not set
# CONFIG_BT_NIMBLE_ENABLED is not set
# CONFIG_ESP_COEX_SW_COEXIST_ENABLE is not set

# CONFIG_NEON_AUDIO is not set
# CONFIG_NEON_LINK_AUDIO is not set
